Assignments/final-project-outline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-31 Fri 18:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Final Project Specification</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="../index.html">↩</a></div><div id="content" class="content">
<h1 class="title">Final Project Specification</h1>
<p>
The following assignment is due <b>Thursday 11/6 by 8:00 PM</b>.  You'll
need to submit a single pdf file in Gradescope.
</p>

<p>
As you know the last month of the course is dedicated to working on a
final project of your choosing. The motivation of this is three-fold:
</p>

<ul class="org-ul">
<li>Rust &amp; Friends is too big of a topic to cover in any reasonable (or
even interesting) way in a single semester.  Working on a project
forces you to get into the weeds for the part of the topic in which
you're most interested.</li>
<li>Rust draws a varied crowd, and it's difficult to design a project
(let alone a whole course) that will cover the aspects of the topic
that are most moving to everyone.</li>
<li>For better or worse, having something that you can put on
github/your personal webpage is valuable thing these days.</li>
</ul>
<div id="outline-container-org1cf6dc5" class="outline-2">
<h2 id="org1cf6dc5">Final Project Expections</h2>
<div class="outline-text-2" id="text-org1cf6dc5">
<p>
The project itself consists of three pieces:
</p>

<ol class="org-ol">
<li><b>The Deliverable.</b> You'll build a thing, be it a piece of code or a
piece of text.  This is the primary part that you'll submit on the
last day of the course (12/9).  <i>Some aspect of the deliverable must
consist of code.</i></li>
<li><b>The Presentation.</b> You'll give a 10 minute presentation during one
of the last two lecture slots on what you made.  This will be
informal, I won't collect any material for this part.  It can
consist of a code walk-through, slides, or a discussion. As long as
you clearly express what you accomplished in your project.</li>
<li><b>The Write-up.</b> You'll write a one-page extended abstract
reflecting on the what you did and your experience working with
Rust &amp; Friends (even if you didn't use Rust in your project). The
write-up should answer the questions:
<ul class="org-ul">
<li>What did you set out to accomplish?</li>
<li>To what extent did you accomplish it?</li>
<li>What possible future work can be done?</li>
<li>How was Rust &amp; Friends helpful/harmful in the process?</li>
<li>What are your general impressions of Rust after having taken the
course?</li>
</ul></li>
</ol>

<p>
Because the project is open-ended, it's possible that parts of the
above description do not apply well to your potential project. If this
is the case, please include in your outline how you plan do deviate
from the above.
</p>
</div>
</div>
<div id="outline-container-org5e3b86c" class="outline-2">
<h2 id="org5e3b86c">Final Project Outline</h2>
<div class="outline-text-2" id="text-org5e3b86c">
<p>
For next week you should submit a document answering the following
prompts.
</p>

<ul class="org-ul">
<li><b>Describe your project.</b> What are you hoping to accomplish? Be as
concrete as possible.  If you're going to write a piece of Rust
code, be clear about what you will be submitting to me.</li>
<li><b>Describe your toolkit.</b> Give a list of the tools and/or references
you will be using for your project. This means papers, crates,
tutorials, documentation.  Think about this as an initial
bibliography.  You should use formal citations (any format), and
include links when possible.  Include as many as you can, ideally
something like 5-10 citations (again, it depends a bit on the
details of the project).</li>
<li><b>Describe your timeline.</b> You'll be required to submit two check-ins
before the final project is due. Outline what you hope to have
accomplished at each check-in. Again, be as concrete and clear as
possible.</li>
</ul>
</div>
</div>
<div id="outline-container-org482bd5b" class="outline-2">
<h2 id="org482bd5b">Closing Remarks</h2>
<div class="outline-text-2" id="text-org482bd5b">
<p>
This is the first time I'm running a course like this with such
open-ended projects. It's as much of an experiment for me as it might
be for you. If I missed anything, or if you have general questions,
don't hesitate to ask. If you have any feedback, don't hesitate to
share it. I'm hoping I can use some of these outlines as examples for
future courses.
</p>
</div>
</div>
</div>
</body>
</html>
